#ifndef CHASSIS_TASK_H
#define CHASSIS_TASK_H

/* 包含头文件 ----------------------------------------------------------------*/
#include "struct_typedef.h"

/* 类型定义 ------------------------------------------------------------------*/

/* 宏定义 --------------------------------------------------------------------*/

/*************************************************
 * Function: Motor_SendMessageForSuperPower
 * Description: 超电底盘缓存功率数据发送
 * Input: obj CAN对象指针
 *        std_id CAN发送标识符
 *        data 裁判系统底盘缓存功率
 * Return: 无
*************************************************/

/* 扩展变量 ------------------------------------------------------------------*/

/* 函数声明 ------------------------------------------------------------------*/
void ChassisTaskInit(void);
#endif  // CHASSIS_TASK_H

